---
layout: post
status: publish
published: true
title: Cosa significa qualit&agrave; nel settore del Web Design
date: '2012-09-10 15:08:20 +0200'
date_gmt: '2012-09-10 13:08:20 +0200'
categories:
- Web programming
tags:
- WebDesign
comments: []
---
<p>Navigando ho trovato un articolo molto interessante scritto da Alex Bulat di <a href="http://www.templatemonster.com/">TemplateMonster</a> sul Web Design. 
L'ho trovato molto interessante ed ho riassunto in poche righe il suo contenuto.</p>
<!--more-->
<p>Essere un Web Designer di qualit&agrave; &egrave; una caratteristica della quale molti si fregiano. Ma cosa significa esattamente? Ho trovato un articolo molto interessante che tratta questo argomento ed elenca le caratteristiche che un design e sviluppo di qualit&agrave; devono avere per poter essere di qualit&agrave;.</p>

<h3>1) La distanza tra gli oggetti sulla pagina</h3>
<p>
	Un sito web di qualit&agrave; deve avere un uso razionale dello spazio. Si deve notare lo spazio tra gli oggetti, come questi sono allineati per dare una sensazione di alt&agrave; qualit&agrave;. L&rsquo;errore pi&ugrave; comune &egrave; posizionare gli elementi ai bordi della pagina. <br />
	Le linee guida per avere una buona gestione dello spazio sono di usare una gliglia con linee guida, non inserire pi&ugrave; elementi del necessario, gli spazi vuoti non vanno riempiti se non necessario.
</p>

<h3>2) Ogni Pixel deve essere perfetto</h3>
<p>
	A volte la resa grafica di un progetto web dipende dai piccoli dettagli, dei quali l&rsquo;utente potrebbe anche non rendersene conto. Pu&ograve; bastare un ombra o un bordo di un pixel per migliorare sensibilmente il sito. Le linee guida da seguire per raggiungere la perfezione grafica sono l&rsquo;attenzione ai piccoli dettagli, usare gli attributi semplici per ottenere l&rsquo;effetto desiderato, comparare i risultati dei tuoi lavori prima e dopo il perfezionamento, noterai sicuramente il migliore impatto grafico.
</p>

<h3>3) Scelta accurata dei Fonts</h3>
<p>Il designer non scrive i testi per il sito ma essi hanno un ruolo molto importante per la qualit&agrave; del sito. I Fonts devono essere facili da leggere e gradevoli alla vista, dovrebbero inoltre tendere a seguire l&rsquo;idea di base del sito.</p>

<h3>4) Organizzazione degli elementi</h3>
<p>L&rsquo;organizzazione delle pagine e degli elementi al loro interno &egrave; sempre diversa da sito in sito. Bisogna chiedersi quale sia lo scopo del sito, se vendere qualcosa o presentare un&rsquo;azienda o ancora un blog tematico, &egrave; necessario <strong>non dimenticare mai la navigabilit&agrave; del sito</strong>, eliminare gli elementi non strettamente necessari.</p>

<h3>5) Delicatezza e pulizia</h3>
<p>E&rsquo; bello provare sempre a creare qualcosa di nuovo e creativo, bisogna per&ograve; ricordarsi che si pu&ograve; ottenere un grande impatto anche rimanendo semplici e puliti, senza fronzoli, con un approccio Clean. Quello che si pu&ograve; fare in questo caso &egrave; usare livelli differenti usanto molteplici texture e patterns, effettuare esperimenti con l&rsquo;opacit&agrave; e a volte rischiare facendo qualcosa di mai visto.</p>

<h3>6) Usare le potenzialit&agrave; dei colori</h3>
<p>I colori di un sito possono in generale richiamare i colori del logo. Bisogna usare sicuramente pi&ugrave; colori, sia per lo sfondo che per i contenuti grafici del sito, bisogna inoltre scegliere i colori in modo che siano coerenti con il resto del sito, contenuti compresi.</p>

<h3>7) Fai qualcosa che nessuno ha ancora fatto</h3>
<p>Alcuni tra i siti pi&ugrave; belli sono molto diversi dagli altri. Quando si progetta qualcosa di nuovo bisogna chiedersi se quanto fatto ha senso, o per esempio peggiora la navigabilit&agrave; del sito o la leggibilit&agrave; dei contenuti.</p>

<p>Se volete saperne di pi&ugrave; andate su&nbsp;<a title="http://blog.templatemonster.com/2012/09/05/quality-web-design-tips-tricks/" href="http://blog.templatemonster.com/2012/09/05/quality-web-design-tips-tricks/" target="_blank">http://blog.templatemonster.com/2012/09/05/quality-web-design-tips-tricks/</a></p>
