---
layout: post
status: publish
published: true
title: Wordpress, perch&eacute; usarlo per un sito
date: '2012-03-23 16:43:10 +0100'
categories:
- Web programming
tags:
- wordpress
- web-designer
comments: []
---
<p>Creare siti &egrave; un&rsquo;attivit&agrave; che a volte rende bene, purtroppo ci sono molte features che i clienti gradirebbero nei loro siti e che sono per&ograve; di difficile implementazione, come la possibilit&agrave; di avere una parte back-office dove poter modificare il sito a proprio piacimento. Si tratta per lo pi&ugrave; di piccole modifiche come cambiare un testo o un&rsquo;immagine, ma non si pu&ograve; pensare di chiamare il web designer e quindi pagarlo per cambiare una singola foto o una stringa di testo.</p>
<!--more-->
<p>Per questo e mille altri motivi &egrave; nato Wordpress, un potente CMS (Content Management System) di facilissima installazione e che permette di creare un sito in pochi minuti. Il sito in questione &egrave; logicamente spoglio e necessita sempre del lavoro di un web-designer che lo modifichi e lo abbellisca ma l&rsquo;utente finale potr&agrave; ad esempio crearci un blog o modificare delle pagine statiche senza dover chiamare nessuno.</p>
<p>Esistono molti altri CMS come Wordpress, i pi&ugrave; conosciuti sono Joomla e Magento, ma la quantit&agrave; di materiale gratuito e premium che si trova per Wordpress &egrave; tale da far sembrare gli altri due prodotti di nicchia (cosa che in realt&agrave; non sono).</p>
<p>Wordpress richiede un server php e un DBMS MySql. Dovendo eseguire delle interrogazioni a un database per leggere gli articoli &egrave; consigliabile usare un plugin che crei una cache. Per motivi di performance &egrave; sempre consigliato di usare server Linux dove wordpress &egrave; pi&ugrave; performante.</p>
<p>Wordpress ha inoltre una serie di plugin e widget scaricabili che rendono la vita dei web-designer facilissima, tra quelli che includono il codice per il controllo di Analytics, quelli che permettono di mostrare pubblicit&agrave; in un post o sulla sidebar, aggiungere informazioni sull&rsquo;autore o dare la possibilit&agrave; di condividere facilmente i contenuti del sito sui maggiori social network. Sono disponibili anche dei plugin per ottimizzare il sito lato SEO, che rendono quindi il sito pi&ugrave; facilmente indicizzabile di motori di ricerca.</p>
<p>In conclusione &egrave; possibile usare Wordpress anche su siti a pagina singola, anche se in questo caso non si sfrutterebbero le sue reali potenzialit&agrave;. E&rsquo; in realt&agrave; una questione di gusti e know-how, se si hanno infatti grande dimestichezza con html css e javascript potrebbe essere preferibile fare un sito da zero, mentre se invece si vuole fare un sito completo nel pi&ugrave; breve tempo possibile ma con tante feture conviene usare wordpress.</p>

<p>Cosa ne pensi? Commenta questo articolo e fammelo sapere.</p>
