---
layout: post
status: publish
published: true
title: Adobe CS6 fra le nuvole
date: '2012-04-23 22:24:50 +0200'
categories:
- Varie
comments: []
---
<p>Manca poco meno di un mese dalla sua data di rilascio e la suite adobe fa gi&agrave; parlare di se, da una parte per le sue novit&agrave; (quest&rsquo;anno di pi&ugrave; rispetto l&rsquo;anno scorso) e dall&rsquo;altra per una modalit&agrave; di pagamento davvero particolare: la <strong>Adobe&nbsp;Creative Cloud</strong>.
</p>
<!--more-->

<p>Cloud &egrave; un nome che si sente sempre pi&ugrave; spesso nel mondo dell&rsquo;informatica, si riferisce, in effetti, a un tipo di elaborazione fatta via web senza che il client conosca effettivamente quale o dove sia il server che contiene le sue informazioni in questo momento. In questo caso con Adobe il Cloud &egrave; utilizzato solo per l&rsquo;immagazzinamento dei salvataggi fino ad un massimo di 20GB.</p>
<p>La forza della Creative Cloud sta nella possibilit&agrave; di poterla &ldquo;Fittare&rdquo; per uno o pi&ugrave; mesi, partendo da prezzi di circa 50&euro; al mese per tutta la suite completa. Il prezzo della master collection &egrave; di 3000&euro; ai quale si deve aggiungere l&rsquo;iva. Si nota subito che se si vuole usare sempre l&rsquo;ultima versione conviene acquistare la Creative Cloud per un anno e poi finch&eacute; non esce la successiva.</p>
<p>La suite conterr&agrave; sicuramente Photoshop nella versione CS6, una versione che in molti hanno gi&agrave; visto tramite una open beta, e vanta circa 600 voci in pi&ugrave;, dopo che la versione 5.1 aveva un po&rsquo; deluso per le poche novit&agrave;.</p>
<p>Anche Dreamweaver avr&agrave; tante novit&agrave; tra le quali l&rsquo;integrazione con Sass e Less (due framework per lo sviluppo di css in modo agevolato), e soprattutto il supporto al design reattivo.</p>
<p>Flash &egrave; sicuramente uno dei componenti della suite pi&ugrave; conosciuti, la Adobe dopo aver annunciato di aver abbandonato lo sviluppo di Flash per i contenuti web su dispositivi mobili ha deciso di continuare a rafforzare nella versione CS6 la possibilit&agrave; di creare App per vari dispositivi mobili tra i quali iOS ed Android, pare che in questo caso si avranno delle prestazioni migliori ed un miglior flusso di lavoro.</p>
<p>Per approfondimenti:</p>
<ul>
<li><a href="http://punto-informatico.it/3503957/PI/News/adobe-manda-cs6-nella-nuvola.aspx">http://punto-informatico.it/3503957/PI/News/adobe-manda-cs6-nella-nuvola.aspx</a></li>
<li><a href="http://www.netmagazine.com/news/adobe-dreamweaver-cs6-embraces-rwd-121920">http://www.netmagazine.com/news/adobe-dreamweaver-cs6-embraces-rwd-121920</a></li>
<li><a href="http://www.netmagazine.com/news/flash-pro-cs6-aims-boost-mobile-gaming-121919">http://www.netmagazine.com/news/flash-pro-cs6-aims-boost-mobile-gaming-121919</a></li>
<li><a href="http://www.businessweek.com/news/2012-04-23/adobe-s-cloud-math-means-new-programs-will-sell-for-less">http://www.businessweek.com/news/2012-04-23/adobe-s-cloud-math-means-new-programs-will-sell-for-less</a></li>
</ul>
