---
layout: post
status: publish
published: true
title: Come guadagnare 5000 dollari al mese creando siti part time
date: '2012-09-14 15:15:45 +0200'
categories:
- Varie
tags:
- freelance
comments:
- id: 6
  author: Aurelio De Rosa
  author_email: aurelioderosa@gmail.com
  author_url: http://www.audero.it
  date: '2012-09-14 17:49:35 +0200'
  date_gmt: '2012-09-14 15:49:35 +0200'
  content: Dubito che in Italia ci sia ancora gente disposta a pagare 1000&euro; per
    un sito web. Ora ognuno &egrave; in grado di farselo da se proprio perch&eacute;
    usa WordPress oppure ci si affida a web agency che pur di lavorare ti fanno un
    sito web completo a 300&euro; (tutto fatturato ovviamente). Ormai il mercato dei
    siti web &egrave; completamente morto a seguito dell'avvento dei CMS. Gli unici
    siti che si possono ancora DAVVERO vendere sono quelli talmente personalizzati
    che un CMS non si adatterebbe bene al caso oppure le web application. Almeno questo
    &egrave; il mio punto di vista corredato dall'esperienza degli ultimi 2-3 anni
    nel settore.
- id: 7
  author: Ale
  author_email: rellovito@libero.it
  author_url: ''
  date: '2012-09-15 13:40:49 +0200'
  date_gmt: '2012-09-15 11:40:49 +0200'
  content: |-
    Aurelio che pessimismo, se ci sai fare davvero in questo campo puoi benissimo guadagnare e campare dignitosamente. Chi si fa pagare poco svaluta la nostra professione. &Egrave; ovvio che tu per farti pagare di pi&ugrave; devi mettere maggiore qualit&agrave;. Un cliente deve essere fiero di quello che paga. Dubito che un 50 enne proprietario di un piccola media azienda sappia fare il sito da solo o installare wordpress...E poi fare un sito internet non significa comprarsi un tema e montarselo su....Ogni sito va personalizzato, deve essere un qualcosa di unico, un progetto che si fa con passione e dedizione, esclusivo, anche se &egrave; un semplice sito statico. Sono bravi a pensare che tutti possono farselo da soli, che lo facessero...ma avere il tema uguale ad altri 100 negozianti o avere un sito che si
    vede tutto storto su IE e che dimostra altre 1000 pecche non credo che giovi molto all'immagine dell'azienda. Non ci si improvvisa nei mestieri, e bisogna farsi rispettare, far cambiare mentalit&agrave; alle persone e non assecondare il mercato e svenderci a 200 euro. Allora posso improvvisarmi anche io negli altri mestieri e fare tutto &ldquo;fai-da-te&rdquo;, bisogna vedere il risultato. Facciamoci rispettare e diamo un' incoraggiamento a chi vuole fare questo mestiere per passione e con professionalit&agrave; :)
- id: 8
  author: Aurelio De Rosa
  author_email: aurelioderosa@gmail.com
  author_url: http://ug.audero.it
  date: '2012-09-15 16:44:07 +0200'
  date_gmt: '2012-09-15 14:44:07 +0200'
  content: 'Ciao Ale. Il tuo discorso fila, peccato che sia "tecnico". Un 50enne non
    lo sa che su alcuni browser si potrebbe vedere bene e su altri male. E'' vero,
    glielo devi far capire MA tu pensi che un 50enne di oggi non abbia un nipote/figlio/conoscente
    che sappia fare 4 cose con un pc e montarglielo? Pensi davvero che i ragazzi SENZA
    partita iva ma che magari sono anche bravini pur di guadagnare qualcosa non glielo
    facciano a 200-300&euro;? Inoltre al giorno d''oggi non c''&egrave; neanche bisogno
    di saper installare Joomla o WordPress. Semplicemente esistono servizi come 1&amp;1
    che ti tolgono anche questa incombenza. Inoltre qualsiasi hosting decente ha gli
    autoinstaller per tutto, quindi un paio di click e ti ritrovi un sito al 100%
    funzionante. Inoltre fare siti web ti crea SEMPRE problemi. Finisci un lavoro
    esattamente come il cliente vuole e ci sono una marea di ripensamenti all''ultimo
    che non ti vengono, ovviamente, mai pagati. La migliore cosa che uno possa fare
    in questo periodo &egrave; la formazione. Paga bene, non hai spese e non hai rotture.
    Questa immagine secondo me &egrave; sempre esplicativa di tutto: https://fbcdn-sphotos-d-a.akamaihd.net/hphotos-ak-ash4/387068_10151161100807698_1315729587_n.jpg'
- id: 9
  author: Alessandro
  author_email: staff@wirepress.it
  author_url: http://wirepress.it/blog
  date: '2013-02-05 18:53:32 +0100'
  date_gmt: '2013-02-05 16:53:32 +0100'
  content: "Aurelio ti do ragione su molte cose. Noi giovani di oggi ce la sappiamo
    cavare sicuramente meglio di quanto non lo sapeste fare voi in passato. La colpa
    &egrave; di internet per tutti, la tv ed altri problemi. Ci&ograve; che manca?
    Secondo me &egrave; l'umilt&agrave; di ammettere di non essere i migliori. Infatti,
    specialmente su internet, tutti (o quasi) si nascondono dietro uno schermo e si
    fingono esperti, professioni, profondi conoscitori.. Ma ovviamente cos&igrave;
    non &egrave;. Chi &egrave; davvero bravo non ha bisogno di utilizzare paroloni
    o effettuare una \"crack\". Basta semplicemente essere umili, rispettare e soprattutto
    attribuire la giusta difficolt&agrave; a qualsiasi cosa. Ovviamente se io creo
    un sito web (e non sono designer ma me la cavo) esce un risultato completo al
    70%, anche all'80%, ma l'esperienza di un web designer preparato ti da quel di
    pi&ugrave; per essere una spanna sopra gli altri. \nIn conclusione ritengo che
    in Italia questo tipo di attivit&agrave; non pu&ograve; n&egrave; essere profittevole
    nel lungo tempo n&egrave; renderti ricco. Ovviamente se si &egrave; in un'agenzia
    che lavora in questo campo oppure si &egrave; in America, allora si pu&ograve;
    parlare di fama e successo. Basti guardare i pi&ugrave; grandi blog sul design,
    non sono italiani. La verit&agrave; &egrave; che all'estero hanno meno prepotenza
    e si mettono a disposizione di tutti, sacrificando il proprio tempo ma avendo
    delle soddisfazioni a lungo termine. All'estero &egrave; possibile lavorare solamente
    con un blog e vivere dei guadagni prodotti dai propri post, se lo si prova a fare
    in Italia si muore di fame.\n\nScusate per la lunghezza del commento ma non potevo
    tenermi tutto dentro.\n\nAlessandro."
- id: 10
  author: alberto
  author_email: albertoesposito1972@libero.it
  author_url: http://albertoesposito1972@libero.it
  date: '2013-03-22 16:31:08 +0100'
  date_gmt: '2013-03-22 15:31:08 +0100'
  content: Vorrei lavorare su web
---
<p>Ho letto e trovato molto interessante un articolo di Jonathan Wold Web Designer Freelance sul sito freelanceswitch.com .</p>
<p>Quanto riporto &egrave; tratto dal suo post che trovate all&rsquo;indirizzo&nbsp;<a href="http://freelanceswitch.com/freelance-web-development/building-websites-part-time/">http://freelanceswitch.com/freelance-web-development/building-websites-part-time/</a></p>
<!--more-->

<p>Jonathan voleva estinguere il suo mutuo in pochi mesi, il problema &egrave; che sia lui che la moglie erano impiegati e quindi avevano uno stipendio che non glielo avrebbe permesso, cos&igrave; lui ha iniziato a fare un secondo lavoro, il webdesigner part time.</p>

<h3>Rendersi disponibili</h3>
<p>Il primo consiglio che da Jonathan &egrave; di rendersi disponibili, i clienti devono sapere che esisti, quindi devi farti conoscere. Anche se non sei conosciuto su internet &egrave; facile iniziare qualche lavoro con le persone che conosci, amici e conoscenti.</p>

<h3>Impegnati</h3>
<p>Bisogna impegnarsi molto per raggiungere i propri obbiettivi, una gazzella se &egrave; attaccata da un ghepardo corre con tutto il suo impegno e non pensa a nient&rsquo;altro, perch&eacute; il suo obiettivo &egrave; rimanere in vita.</p>

<h3>Usa una Piattaforma di sviluppo</h3>
<p>Questo &egrave; un consiglio che personalmente uso sempre. L&rsquo;obiettivo &egrave; di creare siti di buon livello il pi&ugrave; velocemente possibile, iniziare da zero &egrave; ottimo per imparare ma non &egrave; il nostro caso, quindi non comprare libri, ne seguite lunghi corsi teorici. Bisogna concentrarsi sul finire il sito. Usare Wordpress &egrave; molto consigliato, in quanto ha una grande comunity alle spalle e molti componenti da scaricare sia gratuiti che a pagamento, a proposito di questo&hellip;</p>

<h3>Usa temi precostruiti</h3>
<p>Il tema di default di Wordpress pu&ograve; non piacere a tutti i tuoi clienti, &egrave; necessario a questo punto cambiarlo, lo si pu&ograve; sostituire con uno dei tantissimi temi che si trovano online, alcuni sono gratuiti, ma i temi premium (a pagamento) hanno sicuramente un appeal grafico migliore ed hanno un costo che si aggira sui 50$ per utilizzo.</p>

<h3>Il prezzo giusto</h3>
<p>Bisogna scegliere il prezzo giusto per i propri lavori. Jonathan consiglia di chiedere sui 2500$ e mai sotto i 1000$. In Italia io chiederei sui 1000&euro; per un sito non troppo lontano da quello standard con tema e plugin di facile reperibilit&agrave;.</p>

<h3>Esperienza wow </h3>
<p>Crea un esperienza wow, significa in poche parole stupire il cliente. Questa parte cambia da progetto a progetto, bisogna fare in modo che il sito sia unico.</p>

<h3>Poni delle domande e ottieni delle raccomandazioni</h3>
<p>Una volta finito il sito chiedi al cliente di scrivere due righe sul lavoro svolto e sull&rsquo;esperienza di aver lavorato con te e pubblicale sul tuo sito. Chiedi inoltre se conosce qualcun altro che ha bisogno di un sito. Cos&igrave; puoi iniziare a farti conoscere.</p>

<h3>Perfezionati in quello che fai</h3>
<p>L&rsquo;esperienza &egrave; una caratteristica molto importante per qualsiasi lavoro. Finiti i primi lavori inizia ad approfondire uno specifico settore e diventane esperto. Questo &egrave; il momento per comprare libri e/o seguire corsi. Partecipa a forum di discussione online dove porre domande e rispondere a quelle degli altri, in questo modo cominci anche a farti conoscere.</p>

<p>Fare il freelance &egrave; un qualcosa che si rende necessario in momenti di crisi, spesso si viene anche inquadrati come consulente all&rsquo;interno di aziende, dove per&ograve; si lavora come effettivi dipendenti, questo perch&eacute; le aziende risparmiano di pagare i contributi, non devono dare giorni di malattia ecc&hellip;. Essere freelance non &egrave; semplice il giorno in cui non si lavora non si guadagna, non &egrave; il cliente a venire da te ma &egrave; il contrario, non si hanno sempre dei vincoli chiari sul lavoro da fare ed &egrave; anche pi&ugrave; difficile trovare chi ti dia una mano. Tra l&rsquo;altro i guadagni non sono sempre facili, soprattutto per via dell&rsquo;alta pressione fiscale. Sicuramente bisogna essere portati e avere anche spirito di sacrificio.</p>
