---
layout: post
status: publish
published: true
title: 100 anzi 10 lezioni imparate dopo 10 anni di SEO
date: '2013-03-05 15:31:30 +0100'
date_gmt: '2013-03-05 13:31:30 +0100'
categories:
- SEO
tags:
- SEO
comments: []
---
<p>Seguendo il bravissimo e sempre aggiornato <a title="http://www.robertoiacono.it/" href="http://www.robertoiacono.it/" target="_blank">Roberto Iacono</a> via Facebook mi sono imbattuto in questo articolo molto interessante 100 lezioni imparate durante 10 anni di SEO.
<!--more-->
 La persona che lo scrive, Sujan Patel , ha lavorato per dieci anni nel settore SEO, quindi il lato di ottimizzazione dei siti web per una migliore indicizzazione su google. Questo &egrave; uno dei campi in cui ho molto bisogno di imparare e non vedo perch&eacute; non farlo insieme ai miei lettori.</p>

<p><img class="img-fluid"  src="{{ site.url }}/assets/offsite-1.jpg" width="600" height="448" /></p>

<ul>
<li>1) Non creare link di riferimento al tuo sito troppo velocemente &ndash; &egrave; capitato che una volta costruito un sito creasse molti link in entrata per i primi giorni, ma poi non se ne occupava pi&ugrave;, questo portava ad un incremento del rank del sito momentaneo, che poi per&ograve; decresceva velocemente. Il consiglio &egrave; quindi di sostenere un approccio pi&ugrave; continuativo che intenso;</li>
<li>2) Le Meta Description sono importanti &ndash; anche se per il momento non risultano avere un valore SEO, sono utili per il CTR (Click Through Rate);</li>
<li>3) Non essere ossessionato dal traffico e dal rank &ndash; i miglioramenti SEO si vedono nell'arco di mesi e non di giorni o settimane;</li>
<li>4) C'&egrave; una linea sottile tra l'essere analitici e l'essere ossessivi. Per guardare troppo i risultati di ranking si rischia di perdere tempo che si potrebbe impiegare in altri post per il blog o per altri links;</li>
<li>5) Non c'&egrave; un rimpiazzo per un buon prodotto &ndash; la miglior tecnica SEO &egrave; un buon prodotto, e non cambier&agrave; mai;</li>
<li>6) C'&egrave; una grande differenza tra ottimizzare un e-commerce, piccoli siti, ed altri. Bisogna capire non solo l'attuale situazione del sito, ma anche che tipo di sito sia. E la vostra strategia dovrebbe variare in base al tipo di sito;</li>
<li>7) Le tecniche vanno e vengono ma la creativit&agrave; non muore mai - Odio vedere le persone seguire i consigli degli esperti alla cieca, senza conoscere se quella tecnica va bene per il suo tipo di sito;</li>
<li>8) L'et&agrave; &egrave; solo un numero &ndash; L'et&agrave; di un dominio e del sito concorrono ad aumentare il ranking. Ma non c'&egrave; motivo per abbattersi, ci sono anche altri fattori importanti nel ranking che danno opportunit&agrave; di battere i tuoi concorrenti;</li>
<li>9) I grandi brand non sono difficile da battere &ndash; In generale pi&ugrave; grande &egrave; il brand maggiore &egrave; il suo capitale ma &egrave; anche maggiore la lentezza nel muoversi;</li>
<li>10) Diversifica quello che fai &ndash; Google svaluta insiemi di link costruiti in modo simile.</li>

</ul>


<p>Se ti interessano questi temi continua a leggere le altre 90 lezioni su <a title="http://www.quicksprout.com/2012/07/16/100-lessons-learned-from-10-years-of-seo/" href="http://www.quicksprout.com/2012/07/16/100-lessons-learned-from-10-years-of-seo/" target="_blank">http://www.quicksprout.com/2012/07/16/100-lessons-learned-from-10-years-of-seo/</a></p>
<p>Tra gli acquisti che consiglio su Amazon &egrave; presente anche la guida "SEO power. Strategie e strumenti per essere visibili sui motori di ricerca" Scritta da Giorgio Taverniti, ve ne consiglio vivamente la lettura!<br />
Hai mai lavorato con il SEO, hai altri consigli da aggiungere a quanto detto in questo articolo?</p>
