---
layout: post
status: publish
published: true
title: Come aumentare la durata della batteria dell'iPhone
date: '2013-03-27 18:19:16 +0100'
categories:
- Tech
tags:
- iPhone
comments: []
---
<p>Un problema comune nei proprietari dell'iPhone &egrave; una diminuzione notevole della batteria man mano che si installano nuove applicazioni. In questo articolo andremo passo passo esaminando tutte quelle caratteristiche che fanno abbassare la durata della batteria dell'iPhone.</p>
<!--more-->

<h3>La luminosit&agrave;</h3>
<img class="img-fluid"  alt="l'opzione luminosit&agrave; automatica" src="{{ site.url }}/assets/luminosita.png" width="300" height="147" />

<p>La luminosit&agrave; &egrave; una delle cause di maggior consumo della batteria, c'&egrave; da dire che a meno che non ci si trovi con l'esposizione diretta del sole sullo schermo &egrave; inutile avere la luminosit&agrave; al massimo, quindi conviene sempre diminuirla fintanto che &egrave; possibile leggere in maniera chiara dal display. Quello che pu&ograve; diminuire l'illuminazione &egrave; una pellicola non di buona qualit&agrave; o con caratteristiche particolari. Una feature utilizzabile &egrave; la luminosit&agrave; automatica, che aumenta la luminosit&agrave; dello schermo in proporzione alla luminosit&agrave; esterna.</p>

<h3>Il Wifi ed il bluetooth</h3>
<img class="img-fluid"  alt="Anche il wifi &egrave; fonte di grande consumo di energia per il nostro dispositivo" src="{{ site.url }}/assets/wifi.jpeg" width="300" height="207" />
<p>Il Wifi sempre acceso tende a consumare la batteria dell'iPhone, anche se non si usa il wifi, il cellulare controlla sempre se &egrave; connesso in wifi consumando batteria. Quindi &egrave; buona norma attivare il wifi ed il 3g solo quando necessari. La stessa cosa vale per il bluetooth, questo in particolare viene spesso dimenticato acceso quando si usa il vivavoce in auto o se si usano delle casse/cuffie con questa tecnologia, &egrave; consigliabile spegnerlo sempre!</p>
<h3>Notifiche Push</h3>
<img class="img-fluid"  alt="Presentazione delle notifiche push" src="{{ site.url }}/assets/push.jpeg" width="276" height="183" /> </p>
<p>Le notifiche push forniscono aggiornamenti in tempo reale dalle applicazioni, sono il problema principale del consumo energetico del nostro cellulare, ogni applicazione che ne fa uso controlla periodicamente la rete e quindi porta un consumo notevole. Le app pi&ugrave; conosciute che usano le notifiche sono: Facebook, WhatsApp, Viber, Gmail, Dropbox, Fruit Ninja, Skype e Twitter. E' utile quindi attivare solo le notifiche necessarie e disattivare le altre. Cos&igrave; facendo si pu&ograve; avere un aumento notevole della durata.</p>
<img class="img-fluid"   alt="Come funzionano le notifiche Push" src="{{ site.url }}/assets/apple-push-notification-service.jpeg" width="400" height="267" />
<p>Hai anche tu dei suggerimenti dei trucchi per allungare la vita al tuo iPhone? Scrivimi o commenta sotto l'articolo!</p>
