---
layout: post
status: publish
published: true
title: Drupal 8 quali sono le novit&agrave; rispetto drupal 7
date: '2014-10-08 20:15:37 +0200'
categories:
- Web programming
tags:
- drupal
comments: []
---
<p>
	Drupal &egrave; definito pi&ugrave; che un CMS &nbsp;un framework per la creazione di web Application. Il punto di forza di Drupal rispetto ai pi&ugrave; utilizzati Joomla e Wordpress &egrave; la sicurezza, &egrave; infatti utilizzato anche in siti di natura accademica e politica tipicamente soggetti ad attacchi hacker.
	Ultimamentesi parla molto della versione numero 8 eccovene alcune novit&agrave; e differenze rispetto la 7.
</p>
<!--more-->


<h3>User friendly</h3>
<p>
Drupal 8 manterr&agrave; la stessa usabilit&agrave; e semplicit&agrave; della versione 7 avr&agrave; solo delle features in pi&ugrave;. Rimane tuttavia a mio parere inferiore come facilit&agrave; di utilizzo rispetto Wordpress.
</p>

<h3>Configurazione</h3>
<p>In Drupal 7 le informazioni sulla configurazione dell&rsquo;applicazione erano salvate all&rsquo;interno di un database; in Drupal 8 la configurazione &egrave; salvata all&rsquo;interno di un file XML &ldquo;yml&rdquo;, questo a detta degli sviluppatori potrebbe rendere l&rsquo;applicazione pi&ugrave; facilmente modificabile.
</p>

<h3>Multilingua</h3>
<p>Drupal 8 supporta nativamente un sito in pi&ugrave; lingue, cosa che era possibile fare nella versione 7 ma solo con l&rsquo;aiuto di moduli esterni.</p>

<h3>Design</h3>
<p>Drupal 8 usa il twig framework <a href="http://twig.sensiolabs.org/">http://twig.sensiolabs.org</a> per lo sviluppo di temi grafici in maniera pi&ugrave; facile e con features come la reattivit&agrave; pi&ugrave; facilmente ottenibili. Drupal 7 usava semplicemente dei templare php.</p>

<h3>Inline Editing</h3>
<p>Drupal 8 avr&agrave; anche la possibilit&agrave; di effettuare modifiche ai contenuti inline, questo secondo gli sviluppatori auiter&agrave; molto gli autori in fase di correzione o modifica dei testi all&rsquo;interno dei siti.</p>

<h3>Mobile</h3>
<p>Drupal 8 include la possibilit&agrave; di rendere le immagini responsive e la parte amministrativa contiene icone ed immagini facilmente visualizzabili su un dispositivo mobile.</p>

<p>
	Se ti interessa Drupal 8, la sua data di uscita definitiva e tutte le sue differenze con gli altri CMS ti consiglio di visitare il sito del progetto Drupal
  <a href="https://drupal.org/">https://drupal.org</a> , la sua versione italiana
  <a href="http://www.drupal.it/">http://drupal.it</a> ed il sito di pixelcrayons.
	<a href="http://drupal.pixelcrayons.com/kb/drupal-7-vs-drupal-8-whats-new/">http://drupal.pixelcrayons.com/kb/drupal-7-vs-drupal-8-whats-new</a>
</p>
<p>
	Una mia ultima nota personale sul perch&eacute; iniziare ad imparare ad usare drupal 8 e svilupparci temi ed estensioni: Drupal 8 ha tutte le carte in tavola per diventare un CMS popolare quanto Wordpress e Joomla, ma non pu&ograve; sicuramente vantare la stessa quantit&agrave; di estensioni e temi, per questo creare un tema o un estensione per Drupal ne garantisce una maggiore possibilit&agrave; di successo e di diffusione sia se si tratta di materiale free o a pagamento.<br />
</p></p>
