---
layout: post
status: publish
published: true
title: Meglio creare un app o un sito mobile per il tuo business
date: '2014-10-07 18:18:37 +0200'
date_gmt: '2014-10-07 18:18:37 +0200'
categories:
- Web programming
tags:
- mobile
comments: []
---
<p>
	La creazione di contenuti per dispositivi mobili &egrave; sicuramente una delle richieste nel mondo informatico in maggiore crescita. Non c&#039;&egrave; azienda che si rispetti che non abbia un sito ottimizzato per smartphone o addirittura un app mobile. Entrambe le scelte hanno dei lati positivi e negativi riguardanti sia l&#039;impatto con il cliente/visitatore, sia i costi ed i tempi di sviluppo.
</p>
<!--more--> 


<p>
	Le statistiche non mentono, sia in Italia che in tutta Europa le persone che hanno uno smartphone aumentano sempre di pi&ugrave;, inoltre aumentano anche le vendite di Tablet complice il loro abbassamento di prezzo. Un azienda per essere visibile anche dai navigatori del web che utilizzano questi dispositivi deve adattare la grafica e l&rsquo;interfaccia dei propri siti e delle proprie pubblicit&agrave; per questi device con display sensibilmente pi&ugrave; piccoli di un normale PC domestico.
</p>
<p>
	Le possibilit&agrave; per un azienda di entrare in contatto con utenti mobile sono fondamentalmente due:<br />
	-Sito internet;<br />
	-Applicazione.<br />
</p>

	<b>Il sito internet</b> &egrave; uno dei metodi pi&ugrave; usati, consente di mostrare molte informazioni e non &egrave; dipendente dal cellulare dal&nbsp;quale si naviga. Un sito internet pu&ograve;&nbsp;essere fatto appositamente per i device mobili oppure pu&ograve; essere reattivo, ovvero pu&ograve; cambiare grafica in base alla grandezza del device sul quale &egrave; visualizzato. Entrambi questi approcci hanno lati positivi e negativi:<br /><br />
	-Il sito dedicato &egrave; sempre un sito a parte e quindi necessita di una gestione separata e un indirizzo diverso.Allo stesso tempo per&ograve; se fatto bene contiene dati pi&ugrave; importanti per chi naviga da dispositivo mobile, &egrave; pi&ugrave; veloce nel caricamento ed &egrave; meglio indicizzato lato SEO.<br />
	-Il sito reattivo &egrave; un solo sito sia per chi naviga da desktop che per chi naviga da mobile, quindi la modifica di un dato deve essere fatta una sola volta mentre se si dispone di un sito mobile standalone vanno&nbsp;effettuate le modifiche per ogni versione. Di contro il sito reattivo non &egrave; sempre utilissimo per chi usa un cellulare, che potrebbe non essere interessato a lunghissime parti di testo ma solo a delle brevi spiegazioni e delle info su luoghi, numeri ecc&hellip;.<br />
</p></p>
<p>
	L&rsquo;applicazione invece ha sicuramente alcune caratteristiche molto interessanti, in primis tramite l&rsquo;app &egrave; possibile utilizzare la fotocamera o altri componenti hardware dello smartphone quali&nbsp;l&rsquo;accelerometro o il GPS. E&rsquo; altamente ottimizzata per un device in particolare, questa per&ograve; &egrave; un arma a doppio taglio in quanto l&rsquo;applicazione deve essere pubblicata in pi&ugrave; store possibili per essere il pi&ugrave; possibilmente diffusa e questo comporta oltre al costo dell&rsquo;iscrizione agli store anche l&rsquo;utilizzo di linguaggi di programmazione diversi tra loro. Il forte vantaggio &egrave; la possibilit&agrave; di poter lanciare un applicazione anche offline.<br />
</p></p>
<p>
	C&#039;&egrave; poi un approccio ibrido, &egrave; possibile sviluppare applicazioni per Android, iOs, Windows Prone e Blackberry utilizzando un unico codice sorgente. Tutto questo grazie a tool come PhoneGap/Cordova. Il linguaggio di programmazione da utilizzare &egrave; il javascript insieme all&#039;HTML5 ed i CSS3, per le features dei device si utilizzano delle api fornite proprio da PhoneGap o dalla libreria che si sta utilizzando. Le applicazioni cos&igrave; costruite saranno leggermente meno performanti rispetto le versioni native ma portano una notevole diminuzione del tempo di sviluppo.<br />
</p></p>
<p>
	Come abbiamo visto ogni scelta comporta dei pro e dei contro da analizzare in base alla propria nicchia, al proprio target e soprattutto a quanto si vuole spendere.<br />
</p></p>
<p>
	&nbsp;<br />
</p></p>
<p>
	&nbsp;<br />
</p></p>
<p>
	&nbsp;<br />
</p></p>
